## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
s3.tf
```
```terraform
Plan: 3 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                            |
|--------|-----------------------------------------------------------|
| update | `module.cds_salesforce_backups_bucket.aws_s3_bucket.this` |
| add    | `aws_iam_policy.salesforce_replicate`                     |
|        | `aws_iam_role.salesforce_replicate`                       |
|        | `aws_iam_role_policy_attachment.salesforce_replicate`     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.salesforce_replicate will be created
  + resource "aws_iam_policy" "salesforce_replicate" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "SalesforceReplicateToDataLake"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "s3.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.salesforce_replicate will be created
  + resource "aws_iam_role" "salesforce_replicate" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "s3.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SalesforceReplicateToDataLake"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "platform-core-services"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.salesforce_replicate will be created
  + resource "aws_iam_role_policy_attachment" "salesforce_replicate" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SalesforceReplicateToDataLake"
    }

  # module.cds_salesforce_backups_bucket.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "cds-salesforce-backups"
        tags                        = {
            "CostCentre" = "platform-core-services"
            "Critical"   = "true"
            "Terraform"  = "true"
        }
        # (11 unchanged attributes hidden)

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + id       = "send-to-data-lake"
              + priority = 10
              + status   = "Enabled"

              + destination {
                  + bucket = "arn:aws:s3:::cds-data-lake-raw-production"
                }

              + filter {}
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.cds_salesforce_backups_bucket.aws_s3_bucket.this,
  on .terraform/modules/cds_salesforce_backups_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_versioning resource instead

(and 7 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.write_to_bucket"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
